
# Introduction to Pandas

## Pandas

**Pandas:** Pandas is a Python library used for working with data sets. It has functions for analyzing, cleaning, exploring, and manipulating data.

In [2]:
import pandas as pd

## Main objects in Pandas

### Series
A Series is a sequence of data values. It is a list.

In [3]:
pd.Series([1, 2, 3, 4, 5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
my_series =  [1,"two",3,'four',5]
my_index = ['A', 'B', 'C', 'D', 'E'] #adding index
my_var = pd.Series(my_series, index=my_series)
my_var

1          1
two      two
3          3
four    four
5          5
dtype: object

Now we can create a series using Python dictionaries

In [5]:
# Create a dictionary
my_car_dict = {'Tesla': 40, "Mercedez": 32, "BMW": 18}
my_car=pd.Series(my_car_dict)
my_car

Tesla       40
Mercedez    32
BMW         18
dtype: int64

### DataFrame 
A DataFrame is a table containing an array of individual entries, each which has a certain value. Each entry corresponds to a row(or a record) and a column.

In [6]:
pd.DataFrame({'Yes':[50, 21], 'No':[131, 2]})

   Yes   No
0   50  131
1   21    2

We are using the pd.DataFrame() constructor to generate these DataFrame objects. The syntax for declaring a new one is a dictionary whose keys are the column names (Bob and Sue in this example), and whose values are a list of entries.

In [7]:
pd.DataFrame({'Vikram':['Aarambikangala.','It was awesome.'],
              'Leo':['Pretty Good.', 'Bloody Sweat'],
},
index=['Vikram 2023', 'Leo 2024'])

                      Vikram           Leo
Vikram 2023  Aarambikangala.  Pretty Good.
Leo 2024     It was awesome.  Bloody Sweat

The list of row labels used in a DataFrame is known as an Index. We can assign values to it by using an index parameter in our constructor:

Now we are going import Numpy for accessing random library to create random number for DataFrame

In [8]:
import numpy as np
from numpy.random import randn

In [9]:
my_data = randn(4,3) #Rows, Columns
my_rows = ["A", "B", "C", "D"]
my_cols = ["Monday", "Tuesday", "Friday"]

In [10]:
# Create DataFrame
my_df = pd.DataFrame(my_data, my_rows, my_cols )
my_df

     Monday   Tuesday    Friday
A -1.463420 -0.537627 -0.207877
B  1.860897 -1.683871 -0.375152
C -0.446048  0.477725  0.785994
D  0.606379  0.138987 -1.153904

#### Add a new column

In [33]:
my_df["Saturday"]=[np.nan]*len(my_df)
my_df

     Monday   Tuesday    Friday  Saturday
A -1.463420 -0.537627 -0.207877       NaN
B  1.860897 -1.683871 -0.375152       NaN
C -0.446048  0.477725  0.785994       NaN
D  0.606379  0.138987 -1.153904       NaN

In [37]:
my_df.insert(0, "No.", list(range(1,5)), True)
my_df

   No.  No.  No.    Monday   Tuesday    Friday  Saturday
A    1    1    1 -1.463420 -0.537627 -0.207877       NaN
B    2    2    2  1.860897 -1.683871 -0.375152       NaN
C    3    3    3 -0.446048  0.477725  0.785994       NaN
D    4    4    4  0.606379  0.138987 -1.153904       NaN

#### Remove columns or rows

In [43]:
my_df.drop(columns=['No.'])

     Monday   Tuesday    Friday  Saturday
A -1.463420 -0.537627 -0.207877       NaN
B  1.860897 -1.683871 -0.375152       NaN
C -0.446048  0.477725  0.785994       NaN
D  0.606379  0.138987 -1.153904       NaN

### Open a CSV file from repo and show it as a DataFrame

In [11]:
my_df2= pd.read_csv("data.csv")
my_df2

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [12]:
# Pull out rows 
my_df2.loc[0]

Duration     60.0
Pulse       110.0
Maxpulse    130.0
Calories    409.1
Name: 0, dtype: float64

In [13]:
# iloc uses integral position
my_df2.iloc[1]

Duration     60.0
Pulse       117.0
Maxpulse    145.0
Calories    479.0
Name: 1, dtype: float64

In [14]:
# Pull out multiple rows
my_df2.loc[[0,5,168]]

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
5          60    102       127     300.0
168        75    125       150     330.4

##### Accessing rows

In [15]:
my_df2.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [16]:
my_df2.tail(10)

     Duration  Pulse  Maxpulse  Calories
159        30     80       120     240.9
160        30     85       120     250.4
161        45     90       130     260.4
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [17]:
# Get some info from the DataFrame
my_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [18]:
# Find out how many rows and columns
my_df2.shape

(169, 4)

In [19]:
# check the datatypes of each column
my_df2.dtypes

Duration      int64
Pulse         int64
Maxpulse      int64
Calories    float64
dtype: object

In [20]:
# Get statistical info
my_df2['Calories'].describe()

count     164.000000
mean      375.790244
std       266.379919
min        50.300000
25%       250.925000
50%       318.600000
75%       387.600000
max      1860.400000
Name: Calories, dtype: float64

In [21]:
# Grab a single column
my_df2['Calories']

0      409.1
1      479.0
2      340.0
3      282.4
4      406.0
       ...
164    290.8
165    300.0
166    310.2
167    320.4
168    330.4
Name: Calories, Length: 169, dtype: float64

In [22]:
# Grab it using dot notation
my_df2.Calories

0      409.1
1      479.0
2      340.0
3      282.4
4      406.0
       ...
164    290.8
165    300.0
166    310.2
167    320.4
168    330.4
Name: Calories, Length: 169, dtype: float64

In [23]:
# Slice DataFrame like a list in python
my_df2.iloc[1:4:2]

   Duration  Pulse  Maxpulse  Calories
1        60    117       145     479.0
3        45    109       175     282.4

#### Importing new csv file with categorical data

In [24]:
my_df3 = pd.read_csv("dog_data.csv")

In [25]:
my_df3.head()

                 Breed        Color  DogName  OwnerZip
0             COCKAPOO        BROWN  CHARLEY     15236
1         GER SHEPHERD  BLACK/BROWN   TACODA     15238
2        BELG MALINOIS      BRINDLE     EICH     15238
3                MIXED  BLACK/BROWN    ARROW     15104
4  AM PIT BULL TERRIER  WHITE/BROWN   OAKLEY     15139

In [26]:
my_df3["Color"].value_counts()

Color
BLACK                   371
BROWN                   309
WHITE                   226
WHITE/BLACK             196
BLACK/BROWN             183
                       ...
BLACK/ORANGE/BRINDLE      1
BROWN/ORANGE              1
BROWN/FAWN                1
BLACK/BROWN/GREY          1
BROWN/LIVER               1
Name: count, Length: 72, dtype: int64

In [27]:
my_df3["Color"].value_counts(ascending=True)

Color
BROWN/LIVER               1
BROWN/FAWN                1
BROWN/ORANGE              1
BLACK/ORANGE/BRINDLE      1
BLACK/BROWN/GREY          1
                       ...
BLACK/BROWN             183
WHITE/BLACK             196
WHITE                   226
BROWN                   309
BLACK                   371
Name: count, Length: 72, dtype: int64

In [28]:
# To make the missing value listed
my_df3["DogName"].value_counts(dropna=False)

DogName
LUCY       35
BELLA      30
BAILEY     29
BUDDY      29
DAISY      26
           ..
RAMBO       1
CHOOKIE     1
AMY         1
DEE DEE     1
GRIFFIN     1
Name: count, Length: 1429, dtype: int64

In [29]:
# Get relative frequency percentage
my_df3["Color"].value_counts(normalize=True)

Color
BLACK                   0.139212
BROWN                   0.115947
WHITE                   0.084803
WHITE/BLACK             0.073546
BLACK/BROWN             0.068668
                          ...
BLACK/ORANGE/BRINDLE    0.000375
BROWN/ORANGE            0.000375
BROWN/FAWN              0.000375
BLACK/BROWN/GREY        0.000375
BROWN/LIVER             0.000375
Name: proportion, Length: 72, dtype: float64

In [30]:
# count unique values - size
my_df3.groupby('Color').size()

Color
APRICOT              15
BEIGE                 5
BLACK               371
BLACK WITH WHITE     21
BLACK/BRINDLE         5
                   ...
WHITE/ORANGE          5
WHITE/RED            14
WHITE/TAN            50
WHITE/YELLOW          2
YELLOW               51
Length: 72, dtype: int64

In [31]:
# count unique values - count
my_df3.groupby('Color').count()

                  Breed  DogName  OwnerZip
Color
APRICOT              15       15        15
BEIGE                 5        5         5
BLACK               371      371       371
BLACK WITH WHITE     21       21        21
BLACK/BRINDLE         5        5         5
...                 ...      ...       ...
WHITE/ORANGE          5        5         5
WHITE/RED            14       14        14
WHITE/TAN            50       50        50
WHITE/YELLOW          2        2         2
YELLOW               51       51        51

[72 rows x 3 columns]